grevaillot/svd_tools/headers/STM32F7x3/rtc.h
#define RTC_ALRMBR_MNT_SHIFT		12
#define RTC_ALRMBR_MNT_MASK		0x07
/** @defgroup rtc_alrmbr_mnt MNT Minute tens in BCD format
@{*/
/**@}*/


#define RTC_ALRMBR_MNU_SHIFT		8
#define RTC_ALRMBR_MNU_MASK		0x0f
/** @defgroup rtc_alrmbr_mnu MNU Minute units in BCD format
@{*/
/**@}*/

/** RTC_ALRMBR_MSK1 Alarm B seconds mask **/
#define RTC_ALRMBR_MSK1		(1 << 7)

#define RTC_ALRMBR_ST_SHIFT		4
#define RTC_ALRMBR_ST_MASK		0x07
/** @defgroup rtc_alrmbr_st ST Second tens in BCD format
@{*/
/**@}*/


#define RTC_ALRMBR_SU_SHIFT		0
#define RTC_ALRMBR_SU_MASK		0x0f
/** @defgroup rtc_alrmbr_su SU Second units in BCD format
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_wpr WPR write protection register
@{*/


#define RTC_WPR_KEY_SHIFT		0
#define RTC_WPR_KEY_MASK		0xff
/** @defgroup rtc_wpr_key KEY Write protection key
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_ssr SSR sub second register
@{*/


#define RTC_SSR_SS_SHIFT		0
#define RTC_SSR_SS_MASK		0xffff
/** @defgroup rtc_ssr_ss SS Sub second value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_shiftr SHIFTR shift control register
@{*/

/** RTC_SHIFTR_ADD1S Add one second **/
#define RTC_SHIFTR_ADD1S		(1 << 31)

#define RTC_SHIFTR_SUBFS_SHIFT		0
#define RTC_SHIFTR_SUBFS_MASK		0x7fff
/** @defgroup rtc_shiftr_subfs SUBFS Subtract a fraction of a second
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_tstr TSTR time stamp time register
@{*/

/** RTC_TSTR_PM AM/PM notation **/
#define RTC_TSTR_PM		(1 << 22)

#define RTC_TSTR_HT_SHIFT		20
#define RTC_TSTR_HT_MASK		0x03
/** @defgroup rtc_tstr_ht HT Hour tens in BCD format
@{*/
/**@}*/


#define RTC_TSTR_HU_SHIFT		16
#define RTC_TSTR_HU_MASK		0x0f
/** @defgroup rtc_tstr_hu HU Hour units in BCD format
@{*/
/**@}*/


#define RTC_TSTR_MNT_SHIFT		12
#define RTC_TSTR_MNT_MASK		0x07
/** @defgroup rtc_tstr_mnt MNT Minute tens in BCD format
@{*/
/**@}*/


#define RTC_TSTR_MNU_SHIFT		8
#define RTC_TSTR_MNU_MASK		0x0f
/** @defgroup rtc_tstr_mnu MNU Minute units in BCD format
@{*/
/**@}*/


#define RTC_TSTR_ST_SHIFT		4
#define RTC_TSTR_ST_MASK		0x07
/** @defgroup rtc_tstr_st ST Second tens in BCD format
@{*/
/**@}*/


#define RTC_TSTR_SU_SHIFT		0
#define RTC_TSTR_SU_MASK		0x0f
/** @defgroup rtc_tstr_su SU Second units in BCD format
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_tsdr TSDR time stamp date register
@{*/


#define RTC_TSDR_WDU_SHIFT		13
#define RTC_TSDR_WDU_MASK		0x07
/** @defgroup rtc_tsdr_wdu WDU Week day units
@{*/
/**@}*/

/** RTC_TSDR_MT Month tens in BCD format **/
#define RTC_TSDR_MT		(1 << 12)

#define RTC_TSDR_MU_SHIFT		8
#define RTC_TSDR_MU_MASK		0x0f
/** @defgroup rtc_tsdr_mu MU Month units in BCD format
@{*/
/**@}*/


#define RTC_TSDR_DT_SHIFT		4
#define RTC_TSDR_DT_MASK		0x03
/** @defgroup rtc_tsdr_dt DT Date tens in BCD format
@{*/
/**@}*/


#define RTC_TSDR_DU_SHIFT		0
#define RTC_TSDR_DU_MASK		0x0f
/** @defgroup rtc_tsdr_du DU Date units in BCD format
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_tsssr TSSSR timestamp sub second register
@{*/


#define RTC_TSSSR_SS_SHIFT		0
#define RTC_TSSSR_SS_MASK		0xffff
/** @defgroup rtc_tsssr_ss SS Sub second value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_calr CALR calibration register
@{*/

/** RTC_CALR_CALP Increase frequency of RTC by 488.5 ppm **/
#define RTC_CALR_CALP		(1 << 15)
/** RTC_CALR_CALW8 Use an 8-second calibration cycle period **/
#define RTC_CALR_CALW8		(1 << 14)
/** RTC_CALR_CALW16 Use a 16-second calibration cycle period **/
#define RTC_CALR_CALW16		(1 << 13)

#define RTC_CALR_CALM_SHIFT		0
#define RTC_CALR_CALM_MASK		0x1ff
/** @defgroup rtc_calr_calm CALM Calibration minus
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_tampcr TAMPCR tamper configuration register
@{*/

/** RTC_TAMPCR_TAMP3MF Tamper 3 mask flag **/
#define RTC_TAMPCR_TAMP3MF		(1 << 24)
/** RTC_TAMPCR_TAMP3NOERASE Tamper 3 no erase **/
#define RTC_TAMPCR_TAMP3NOERASE		(1 << 23)
/** RTC_TAMPCR_TAMP3IE Tamper 3 interrupt enable **/
#define RTC_TAMPCR_TAMP3IE		(1 << 22)
/** RTC_TAMPCR_TAMP2MF Tamper 2 mask flag **/
#define RTC_TAMPCR_TAMP2MF		(1 << 21)
/** RTC_TAMPCR_TAMP2NOERASE Tamper 2 no erase **/
#define RTC_TAMPCR_TAMP2NOERASE		(1 << 20)
/** RTC_TAMPCR_TAMP2IE Tamper 2 interrupt enable **/
#define RTC_TAMPCR_TAMP2IE		(1 << 19)
/** RTC_TAMPCR_TAMP1MF Tamper 1 mask flag **/
#define RTC_TAMPCR_TAMP1MF		(1 << 18)
/** RTC_TAMPCR_TAMP1NOERASE Tamper 1 no erase **/
#define RTC_TAMPCR_TAMP1NOERASE		(1 << 17)
/** RTC_TAMPCR_TAMP1IE Tamper 1 interrupt enable **/
#define RTC_TAMPCR_TAMP1IE		(1 << 16)
/** RTC_TAMPCR_TAMPPUDIS TAMPER pull-up disable **/
#define RTC_TAMPCR_TAMPPUDIS		(1 << 15)

#define RTC_TAMPCR_TAMPPRCH_SHIFT		13
#define RTC_TAMPCR_TAMPPRCH_MASK		0x03
/** @defgroup rtc_tampcr_tampprch TAMPPRCH Tamper precharge duration
@{*/
/**@}*/


#define RTC_TAMPCR_TAMPFLT_SHIFT		11
#define RTC_TAMPCR_TAMPFLT_MASK		0x03
/** @defgroup rtc_tampcr_tampflt TAMPFLT Tamper filter count
@{*/
/**@}*/


#define RTC_TAMPCR_TAMPFREQ_SHIFT		8
#define RTC_TAMPCR_TAMPFREQ_MASK		0x07
/** @defgroup rtc_tampcr_tampfreq TAMPFREQ Tamper sampling frequency
@{*/
/**@}*/

/** RTC_TAMPCR_TAMPTS Activate timestamp on tamper detection event **/
#define RTC_TAMPCR_TAMPTS		(1 << 7)
/** RTC_TAMPCR_TAMP3TRG Active level for tamper 3 **/
#define RTC_TAMPCR_TAMP3TRG		(1 << 6)
/** RTC_TAMPCR_TAMP3E Tamper 3 detection enable **/
#define RTC_TAMPCR_TAMP3E		(1 << 5)
/** RTC_TAMPCR_TAMP2TRG Active level for tamper 2 **/
#define RTC_TAMPCR_TAMP2TRG		(1 << 4)
/** RTC_TAMPCR_TAMP2E Tamper 2 detection enable **/
#define RTC_TAMPCR_TAMP2E		(1 << 3)
/** RTC_TAMPCR_TAMPIE Tamper interrupt enable **/
#define RTC_TAMPCR_TAMPIE		(1 << 2)
/** RTC_TAMPCR_TAMP1TRG Active level for tamper 1 **/
#define RTC_TAMPCR_TAMP1TRG		(1 << 1)
/** RTC_TAMPCR_TAMP1E Tamper 1 detection enable **/
#define RTC_TAMPCR_TAMP1E		(1 << 0)

/**@}*/

/** @defgroup rtc_alrmassr ALRMASSR alarm A sub second register
@{*/


#define RTC_ALRMASSR_MASKSS_SHIFT		24
#define RTC_ALRMASSR_MASKSS_MASK		0x0f
/** @defgroup rtc_alrmassr_maskss MASKSS Mask the most-significant bits starting at this bit
@{*/
/**@}*/


